<script lang="ts" setup>
const { t } = useI18n({ useScope: 'local' })

useSeoMeta({
  title: t('title'),
})
useHead({
  title: t('title'),
})

definePageMeta({
  layout: 'default',
})
</script>

<template>
  <PageWrapper class="container flex flex-col">
    <PageTitle
      :text="t('title')"
      class="mb-4 text-center capitalize"
    />
    <PageBody>
      <div class="article container-xs">
        <p
          class="
            text-primary-950

            dark:text-primary-50
          "
        >
          Στο www.webside.gr χρησιμοποιούμε cookies για να κάνουμε καλύτερη την εμπειρία σου στο site μας. Η χρήση των
          cookies μας βοηθάει να βελτιώσουμε τις λειτουργίες του site, να κάνουν πιο εύκολη την περιήγηση σου αλλά και
          να σε διευκολύνουν στις επιλογές σου. Έτσι, μπορούμε να σου παρέχουμε εξατομικευμένο περιεχόμενο και
          διαφημίσεις που βασίζονται στα ενδιαφέροντα και τις ανάγκες σου. Επιπλέον, τα cookies χρησιμοποιούνται για να
          αναλύσουμε την επισκεψιμότητα του site μας και να εντοπίσουμε προβληματικές σελίδες που χρήζουν βελτίωσης.
          Στόχος μας είναι να βελτιώνουμε το site μας για να παρέχουμε συνεχώς καλύτερες υπηρεσίες αλλά και εμπειρία
          κατά την επίσκεψη των χρηστών μας. Στο www.webside.gr πρωταρχικός στόχος είναι η προστασία της ιδιωτικότητας
          των επισκεπτών της ιστοσελίδας και για το λόγο αυτό ο οργανισμός τηρεί αυστηρή πολιτική. Σου προτείνουμε να
          αφιερώσεις λίγο χρόνο και να διαβάσεις αυτήν την πολιτική, ώστε να μπομπορείς να κατανοήσεις τον τύπο των
          cookies που χρησιμοποιούμε, τις πληροφορίες που συλλέγουμε χρησιμοποιώντας τα cookies και πώς χρησιμοποιούνται
          αυτές οι πληροφορίες. Χρησιμοποιώντας την ιστοσελίδα μας συμφωνείς με την χρήση των cookies σύμφωνα με αυτήν
          την πολιτική. Τι είναι τα Cookies; Τα «cookies» είναι μικρά αρχεία με πληροφορίες που μια ιστοσελίδα
          αποθηκεύει στον υπολογιστή ενός χρήστη (συνήθως στο πρόγραμμα περιήγησης ιστού όπως Chrome, Opera, Mozilla
          Firefox, Edge, etc), ώστε κάθε φορά που ο χρήστης συνδέεται στην ιστοσελίδα, η τελευταία να ανακτά τις εν λόγω
          πληροφορίες και να προσφέρει στον χρήστη σχετικές με αυτές υπηρεσίες. Χαρακτηριστικό παράδειγμα τέτοιων
          πληροφοριών είναι οι προτιμήσεις του χρήστη σε μια ιστοσελίδα, όπως αυτές δηλώνονται από τις επιλογές που
          κάνει ο χρήστης στη συγκεκριμένη ιστοσελίδα (π.χ. επιλογή συγκεκριμένων «κουμπιών», αναζητήσεων, διαφημίσεων,
          κλπ). Γενικές πληροφορίες ταξινόμησης των Cookies Υπάρχουν δύο γενικές κατηγορίες cookies: Τεχνικά cookies:
          απαραίτητα για την ορθή λειτουργία ενός ιστότοπου και για την περιήγηση σε αυτόν από τον χρήστη. Χωρίς αυτά,
          οι χρήστες ενδέχεται να μην είναι σε θέση να προβάλλουν σωστά τις σελίδες ή να χρησιμοποιήσουν ορισμένες
          υπηρεσίες. Cookies δημιουργίας προφίλ: χρησιμοποιούνται για τη δημιουργία προφίλ χρηστών για την αποστολή
          διαφημιστικών μηνυμάτων σύμφωνα με τις προτιμήσεις που εμφανίζει ο χρήστης κατά την περιήγηση. Τα cookies,
          είτε «τεχνικά» είτε «δημιουργίας προφίλ», μπορούν επίσης να ταξινομηθούν ως: cookies «συνεδρίας», τα οποία
          διαγράφονται αμέσως μετά το κλείσιμο του προγράμματος περιήγησης «μόνιμα» cookies, τα οποία παραμένουν στο
          πρόγραμμα περιήγησης για ορισμένο χρονικό διάστημα. Αυτά τα cookies χρησιμοποιούνται, για παράδειγμα, για την
          αναγνώριση της συσκευής που συνδέεται με έναν ιστότοπο, διευκολύνοντας τις διαδικασίες ελέγχου ταυτότητας
          χρήστη «ιδιόκτητα» cookies, τα οποία δημιουργούνται και ελέγχονται απευθείας από τον χειριστή του ιστότοπου
          στον οποίο ο χρήστης περιηγείται cookies «τρίτων μερών», τα οποία δημιουργούνται και ελέγχονται από μέρη εκτός
          του χειριστή του ιστότοπου στον οποίο ο χρήστης περιηγείται. Ο Ιστότοπος μας χρησιμοποιεί «τεχνικά» cookies
          και ειδικότερα τους ακόλουθους τύπους cookies: Ιδιόκτητα cookies, cookies συνεδρίας ή μόνιμα cookies, που
          είναι απαραίτητα για την περιήγηση στον Ιστότοπο, για σκοπούς εσωτερικής ασφάλειας και διαχείρισης συστημάτων
          cookies τρίτων μερών, μόνιμα cookies, που χρησιμοποιούνται από τον Ιστότοπο για την αποστολή στατιστικών
          πληροφοριών στο Google Analytics, μέσω των οποίων η Εταιρεία μπορεί να πραγματοποιήσει στατιστική ανάλυση της
          πρόσβασης / των επισκέψεων στον Ιστότοπο. Τα cookies που χρησιμοποιούνται εξυπηρετούν αποκλειστικά
          στατιστικούς σκοπούς και συλλέγουν πληροφορίες σε συγκεντρωτική μορφή. Χρησιμοποιώντας δύο cookies, τα μόνιμα
          cookies και τα cookies συνεδρίας (που λήγουν με το κλείσιμο του προγράμματος περιήγησης), το Google Analytics
          αποθηκεύει επίσης ένα μητρώο με τις ώρες έναρξης των επισκέψεων στον Ιστότοπο και εξόδου από αυτόν. Μπορείτε
          να εμποδίσετε την Google να συλλέγει δεδομένα μέσω των cookies και την επακόλουθη επεξεργασία των δεδομένων,
          μεταφορτώνοντας και εγκαθιστώντας την προσθήκη για το πρόγραμμα περιήγησης από την ακόλουθη διεύθυνση:
          http://tools.google.com/dlpage/gaoptout. Μπορείς να επιλέξεις για ποια cookies να δώσεις τη συγκατάθεσή σου
          πατώντας εδώ. Στην περίπτωση των cookies τρίτων μερών, οι χρήστες παρέχουν ή αρνούνται να παράσχουν τη
          συγκατάθεσή τους απευθείας στον κάτοχο του εν λόγω cookie, στον οποίο αναφέρεται απλώς η Εταιρεία: τα
          περισσότερα cookies τρίτων μερών που υπάρχουν στον ιστότοπο μπορούν να απενεργοποιηθούν από τους χρήστες στο
          δικό τους πρόγραμμα περιήγησης ή πραγματοποιώντας απευθείας επίσκεψη στους ιστότοπους των φορέων λειτουργίας
          τους χρησιμοποιώντας τους συνδέσμους που αναφέρονται στον παρακάτω πίνακα. Σε κάθε περίπτωση, επισημαίνουμε
          ότι η απενεργοποίηση των cookies μπορεί να επηρεάσει τη δυνατότητά σου να χρησιμοποιείς το site ή/και να
          αξιοποιήσεις στο έπακρο όλες τις διαθέσιμες λειτουργίες και υπηρεσίες.
        </p>
        <p
          class="
            text-primary-950 text-xl font-semibold

            dark:text-primary-50
          "
        >
          Ειδικότερη κατηγοριοποίηση των Cookies ως προς τη λειτουργία τους:
        </p>
        <ul
          class="
            text-primary-950

            dark:text-primary-50
          "
        >
          <li>
            Αναγκαία Επιτρέπουν τις βασικές λειτουργίες του site, όπως την πλοήγηση και την πρόσβαση σε ασφαλείς
            περιοχές της ιστοσελίδας, την προσθήκη προϊόντων στο καλάθι και την ολοκλήρωση αγορών. Τα αναγκαία Cookies
            είναι απαραίτητα για να λειτουργήσει σωστά το site και να εξυπηρετήσει το σκοπό την επίσκεψης του χρήστη
            (π.χ. ολοκλήρωση αγοράς).
          </li>
          <li>
            Προτιμήσεις Επιτρέπουν σε μια ιστοσελίδα να θυμάται πληροφορίες που αλλάζουν τον τρόπο που συμπεριφέρεται η
            ιστοσελίδα ή την εμφάνισή της, όπως την προτιμώμενη γλώσσα ή την περιοχή στην οποία βρίσκεστε.
          </li>
          <li>
            Στατιστικά Mας βοηθούν να κατανοήσουμε πως χρησιμοποιούν και αλληλοεπιδρούν οι επισκέπτες με τις διάφορες
            σελίδες, συλλέγοντας και αναφέροντας ανώνυμα πληροφορίες.
          </li>
          <li>
            Εμπορικής προώθησης Αυτά τα cookies χρησιμοποιούνται για την παροχή διαφημίσεων με περιεχόμενο που ταιριάζει
            στους χρήστες και τα ενδιαφέροντά τους. Η πρόθεση είναι να εμφανίσουμε διαφημίσεις που είναι σχετικές και
            ελκυστικές για τους χρήστες και ως εκ τούτου πιο πολύτιμες για τρίτους εκδότες και διαφημιστές.
          </li>
        </ul>
        <p
          class="
            text-primary-950 text-xl font-semibold

            dark:text-primary-50
          "
        >
          Πώς να ελέγξεις τα cookies
        </p>
        <p
          class="
            text-primary-950

            dark:text-primary-50
          "
        >
          Τα περισσότερα προγράμματα περιήγησης στο internet σου παρέχουν τη δυνατότητα να καθορίσεις εάν θέλεις ή όχι
          τη χρήση cookies. Οι ακόλουθες σελίδες παρέχουν τις οδηγίες για την ρύθμιση των cookies στα πιο γνωστά
          προγράμματα περιήγησης στο web:
        </p>
        <ul
          class="
            text-primary-950

            dark:text-primary-50
          "
        >
          <li>
            <a
              href="https://support.mozilla.org/en-US/kb/cookies-information-websites-store-on-your-computer?redirectlocale=en-US&redirectslug=Cookies"
              target="_blank"
              rel="noopener"
            >Ρυθμίσεις cookies για το Firefox</a>
          </li>
          <li>
            <a
              href="https://support.google.com/chrome/answer/95647?hl=en"
              target="_blank"
              rel="noopener"
            >Ρυθμίσεις cookies για το Chrome</a>
          </li>
          <li>
            <a
              href="https://support.apple.com/safari"
              target="_blank"
              rel="noopener"
            >Ρυθμίσεις cookies για το Safari</a>
          </li>
          <li>
            <a
              href="https://support.microsoft.com/el-gr/microsoft-edge/%CE%B1%CF%83%CF%86%CE%AC%CE%BB%CE%B5%CE%B9%CE%B1-%CE%BA%CE%B1%CE%B9-%CF%80%CF%81%CE%BF%CF%83%CF%84%CE%B1%CF%83%CE%AF%CE%B1-9459eef6-f8d8-4c6b-b3d5-d038e624da57"
              target="_blank"
              rel="noopener"
            >Ρυθμίσεις cookies για το Edge</a>
          </li>
        </ul>
      </div>
    </PageBody>
  </PageWrapper>
</template>

<i18n lang="yaml">
el:
  title: Πολιτική Cookies
</i18n>
